export const introduction1: string[] = [
  "- شركة إنتيجريشن لوساطة التأمن تحرص دائما على المصداقية الكاملة والشفافية في معاملاتها والسعي إلى زيادة التواصل مع العملاء لتحقيق الأمان الدائم لهم.",
  "- شركة إنتيجريشن لوساطة التأمين شركة مساهمة مصرية ومقيدة لدى الهيئة العامة للرقابة المالية بسجل وسطاء التأمين (شخص اعتباري) ترخيص رقم (۸۸) ومتخصصة في مجال وساطة التأمين.",
  "- شركة إنتيجريشن لوساطة التأمين وسيط تأمين متخصص ذو خبرة عالية يقدم مجموعة من الحلول التأمينية لإدارة المخاطر ومتابعة إصدار التغطية التأمينية المناسبة لحماية الأصول والمسئوليات والأفراد.",
];

export const introduction2: string[] = [
  "- نحن نعمل مع عملائنا في شراكات لدراسة الأصول وتحديد المخاطر التي يمكن تأمينها ثم تصميم الحلول التأمينية الملائمة وإصدارها لدى شركات التأمين المصرية.",
  "- نعمل مع جميع شركات التأمين في السوق المصري، وفي جميع منتجات التأمين المتاحة في السوق، مع متابعة دائمة بممارسات التأمين في الأسواق العالمية.",
  "- من خلال خبراتنا الطويلة فنحن نقدم لعملائنا أفضل مستويات الخدمة التأمينية بالسوق المصري.",
];
