export const introduction1: string[] = [
  "- نحن شركة لوساطة التأمين و نحرص دائما على المصداقية الكاملة والشفافية في معاملاتنا والسعي إلى زيادة التواصل مع العملاء لتحقيق الأمان الدائم لهم.",
  "- نحن شركة مساهمة مصرية ومقيدة لدى الهيئة العامة للرقابة المالية بسجل وسطاء التأمين (شخص اعتباري) ترخيص رقم (۸۸) ومتخصصون في مجال وساطة التأمين.",
  "- نحن وسيط تأمين متخصص ذو خبرة عالية يقدم مجموعة من الحلول التأمينية لإدارة المخاطر ومتابعة إصدار التغطية التأمينية المناسبة لحماية الأصول والمسئوليات والأفراد.",
];

export const introduction2: string[] = [
  "- نحن نعمل مع عملائنا في شراكات لدراسة الأصول وتحديد المخاطر التي يمكن تأمينها ثم تصميم الحلول التأمينية الملائمة وإصدارها لدى شركات التأمين المصرية.",
  "- نعمل مع جميع شركات التأمين في السوق المصري، وفي جميع منتجات التأمين المتاحة في السوق، مع متابعة دائمة بممارسات التأمين في الأسواق العالمية.",
  "- من خلال خبراتنا الطويلة فنحن نقدم لعملائنا أفضل مستويات الخدمة التأمينية بالسوق المصري.",
];
