import { IconType } from "react-icons";
import {
  FaBuilding,
  FaChartBar,
  FaFileInvoiceDollar,
  FaHeadset,
  FaShieldAlt,
  FaUserTie,
} from "react-icons/fa";

type OurServicesType = {
  cardIcon: IconType;
  cardTitle: string;
  cardParagraph: string;
  cardParagraph2?: string;
};

export const ourServices: OurServicesType[] = [
  {
    cardIcon: FaShieldAlt,
    cardTitle: "حلول و توصيات تأمينية",
    cardParagraph:
      "- لجميع أنواع التأمين الموجودة بالسوق المصري و تقديم نماذج للحلول التأمينية المعمول بها في مصر و الاأسواق العالمية.",
    cardParagraph2:
      "- نقوم بدراسة وثائق التأمين الحالية و تقديم دراسة بمقترحات التطوير للشروط و الأسعار.",
  },
  {
    cardIcon: FaChartBar,
    cardTitle: "دراسة الأصول الثابتة و المتداولة",
    cardParagraph:
      "- دراسة الأصول لتقدير المخاطر وتقديم التوصيات لأفضل الحلول التأمينية المناسبة.",
    cardParagraph2:
      "- دراسة تقييم الأصول المؤمنة مقارنة بالقيم السوقية الحالية لضمان تغطية مناسبة وضمان حقوق العملاء في حالة التعويض.",
  },
  {
    cardIcon: FaHeadset,
    cardTitle: "خدمة عملاء محترفة و متخصصة",
    cardParagraph:
      "- يتم تعيين مسئول للتعامل مع طلبات العميل اليوميه من (تعديل-اضافة-الغاء) او اي طلبات اخري.",
    cardParagraph2:
      "- نقوم بمتابعة التجديدات و توفير عروض جديدو عند التجديد لايجاد بدائل دائمه للعملاء.",
  },
  {
    cardIcon: FaBuilding,
    cardTitle: "ادارة كاملة مع شركات التأمين",
    cardParagraph:
      "- كل المخاطبات مع شركات التأمين من طلب عروض الأسعار، تقديم دراسة مقارنة للعروض، تقديم التوصيات إلى إصدار وثائق التأمين ومراجعتها وسدادها ثم أي تعديل مطلوب خلال السنة التأمينية وبالتأكيد أيضًـا حـال وجود أي حادث.",
  },
  {
    cardIcon: FaFileInvoiceDollar,
    cardTitle: "متابعة كاملة للتعويضات",
    cardParagraph:
      "- في حالة وجود حادث، نقوم بمتابعة كاملة للمطالبات مع شركات التأمين بدءًا من إخطار الحادث، تجميع وتقديم المستندات المطلوبة ومراجعتها ثم التفاوض مع الخبراء المعينين ومع شركة التأمين وحتى التسوية النهائية ودفع التعويض للعميل.",
  },
  {
    cardIcon: FaUserTie,
    cardTitle: "استشارات تأمينية متخصصة",
    cardParagraph:
      "- في حالة احتياج عميلنا إلى استشارات تأمينية متخصصة سواء في تقييم المخاطر أو تقييم الأصول بغرض التأمين أو تسوية التعويضات ، فإننا نقدم له هذه الخدمات من خلال أفضل و أقوي فريق عمل والذي يملك خبرة كبيرة في جميع أنواع التغطيات التأمينية المختلفة.",
  },
];
