import { IconType } from "react-icons";
import {
  FaBuilding,
  FaChartBar,
  FaFileInvoiceDollar,
  FaHeadset,
  FaHome,
  FaPiggyBank,
  FaRegFileAlt,
  FaShieldAlt,
  FaUserMd,
  FaUserTie,
} from "react-icons/fa";
import { GiLifeBar } from "react-icons/gi";
import { MdOutlineInsights } from "react-icons/md";

type OurServicesType = {
  cardIcon: IconType;
  cardTitle: string;
  cardParagraph: string;
  cardParagraph2?: string;
};

export const ourServices: OurServicesType[] = [
  {
    cardIcon: FaShieldAlt,
    cardTitle: "حلول و توصيات تأمينية",
    cardParagraph:
      "لجميع أنواع التأمين الموجودة بالسوق المصري و تقديم نماذج للحلول التأمينية المعمول بها في مصر و الأسواق العالمية.",
    cardParagraph2:
      "نقوم بدراسة وثائق التأمين الحالية و تقديم دراسة بمقترحات التطوير للشروط و الأسعار.",
  },
  {
    cardIcon: FaChartBar,
    cardTitle: "دراسة الأصول الثابتة و المتداولة",
    cardParagraph:
      "دراسة الأصول لتقدير المخاطر وتقديم التوصيات لأفضل الحلول التأمينية المناسبة.",
    cardParagraph2:
      "دراسة تقييم الأصول المؤمنة مقارنة بالقيم السوقية الحالية لضمان تغطية مناسبة وضمان حقوق العملاء في حالة التعويض.",
  },
  {
    cardIcon: FaHeadset,
    cardTitle: "خدمة عملاء محترفة و متخصصة",
    cardParagraph:
      "يتم تعيين مسئول للتعامل مع طلبات العميل اليوميه من (تعديل-اضافة-الغاء) او اي طلبات اخري.",
    cardParagraph2:
      "نقوم بمتابعة التجديدات و توفير عروض جديدة عند التجديد لايجاد بدائل دائمه للعملاء.",
  },
  {
    cardIcon: FaBuilding,
    cardTitle: "ادارة كاملة مع شركات التأمين",
    cardParagraph:
      "كل المخاطبات مع شركات التأمين من طلب عروض الأسعار، تقديم دراسة مقارنة للعروض، تقديم التوصيات إلى إصدار وثائق التأمين ومراجعتها وسدادها ثم أي تعديل مطلوب خلال السنة التأمينية وبالتأكيد أيضًـا حـال وجود أي حادث.",
  },
  {
    cardIcon: FaFileInvoiceDollar,
    cardTitle: "متابعة كاملة للتعويضات",
    cardParagraph:
      "في حالة وجود حادث، نقوم بمتابعة كاملة للمطالبات مع شركات التأمين بدءًا من إخطار الحادث، تجميع وتقديم المستندات المطلوبة ومراجعتها ثم التفاوض مع الخبراء المعنيين ومع شركة التأمين وحتى التسوية النهائية ودفع التعويض للعميل.",
  },
  {
    cardIcon: FaUserTie,
    cardTitle: "استشارات تأمينية متخصصة",
    cardParagraph:
      "في حالة احتياج عميلنا إلى استشارات تأمينية متخصصة سواء في تقييم المخاطر أو تقييم الأصول بغرض التأمين أو تسوية التعويضات ، فإننا نقدم له هذه الخدمات من خلال أفضل و أقوي فريق عمل والذي يملك خبرة كبيرة في جميع أنواع التغطيات التأمينية المختلفة.",
  },
  {
    cardIcon: MdOutlineInsights,
    cardTitle: "تحليل المخاطر والتوصيات الوقائية",
    cardParagraph:
      "نقوم بدراسة وتحليل جميع المخاطر المحتملة التي قد تواجه الأفراد والشركات من خلال جمع البيانات وتحليلها باستخدام أحدث الأساليب، ومن ثم نقدم التوصيات الوقائية المناسبة التي تساعد على تقليل احتمالية وقوع الحوادث وضمان استمرارية الأعمال بأعلى مستويات الأمان والاستقرار.",
  },
  {
    cardIcon: FaRegFileAlt,
    cardTitle: "إدارة المطالبات التأمينية",
    cardParagraph:
      "نقوم بإدارة ومتابعة جميع مراحل المطالبات التأمينية بدءًا من لحظة الإبلاغ عن الحادث وجمع كافة المستندات المطلوبة والتنسيق مع الجهات المختصة، وحتى استلام التعويض المستحق، مما يضمن للعميل تجربة سلسة وعادلة دون أي تعقيدات أو تأخير.",
  },
  {
    cardIcon: FaPiggyBank,
    cardTitle: "التخطيط المالي التأميني",
    cardParagraph:
      "نعمل على تقديم استراتيجيات تأمينية متكاملة تساعد الأفراد والشركات على تحقيق الأمان المالي من خلال اختيار وتخصيص خطط تأمينية تتناسب مع احتياجاتهم الحالية والمستقبلية، مما يوفر لهم تغطية تأمينية مثالية تضمن الحماية والاستقرار المالي في مختلف الظروف.",
  },
  {
    cardIcon: FaUserMd,
    cardTitle: "التأمين الصحي وإدارة الرعاية الطبية",
    cardParagraph:
      "نقدم حلول التأمين الصحي المصممة لتلبية احتياجات الأفراد والشركات، حيث نساعد في اختيار البرامج التأمينية التي توفر تغطية شاملة للخدمات الطبية، ونتولى إدارة المطالبات والتنسيق مع مقدمي الرعاية الصحية لضمان حصول العملاء على أفضل الخدمات بأقل التكاليف الممكنة.",
  },
  {
    cardIcon: FaHome,
    cardTitle: "التأمين على الممتلكات والمسؤوليات",
    cardParagraph:
      "نساعد الأفراد والشركات في حماية ممتلكاتهم من المخاطر المحتملة من خلال توفير استراتيجيات تأمينية متكاملة تغطي العقارات، المعدات، والممتلكات التجارية، مع تقديم المشورة حول أفضل الحلول لضمان التعويض العادل في حال وقوع أي خسائر أو أضرار.",
  },
  {
    cardIcon: GiLifeBar,
    cardTitle: "التأمين على الحياة والتخطيط للمستقبل",
    cardParagraph:
      "نعمل على تقديم خطط تأمين على الحياة تناسب مختلف الفئات وتساعد الأفراد والعائلات على تحقيق الأمان المالي والاستقرار، حيث نوفر خيارات متعددة تضمن الحماية ضد المخاطر المستقبلية، بالإضافة إلى خطط ادخارية واستثمارية تعزز الاستقلال المالي على المدى الطويل.",
  },
];
